KC5-BP/C8051F020-WS2812B/refFiles/mx_manip/ws2812_mx_manip.c
                    case '[':
                        addressMatrix[NeoPix_Pos].status = cBoard_OpenSqBracket[OFF_CHAR_DIM_5X7 - CharReadOrga];
                        break;
                    //case '\\':
                    //  addressMatrix[NeoPix_Pos].status = ;
                    //  break;
                    case ']':
                        addressMatrix[NeoPix_Pos].status = cBoard_CloseSqBracket[OFF_CHAR_DIM_5X7 - CharReadOrga];
                        break;
					case '^':
						addressMatrix[NeoPix_Pos].status = cBoard_Heart[OFF_CHAR_DIM_7X6 - CharReadOrga];
						break;
                    case '_':
                        addressMatrix[NeoPix_Pos].status = cBoard_Underscore[OFF_CHAR_DIM_4X7 - CharReadOrga];
                        break;
                    //case '`':
                    //  addressMatrix[NeoPix_Pos].status = ;
                    //  break;
                    case '{':
                        addressMatrix[NeoPix_Pos].status = cBoard_OpenRoBracket[OFF_CHAR_DIM_5X7 - CharReadOrga];
                        break;
                    //case '|':
                    //  addressMatrix[NeoPix_Pos].status = ;
                    //  break;
                    case '}':
                        addressMatrix[NeoPix_Pos].status = cBoard_CloseRoBracket[OFF_CHAR_DIM_5X7 - CharReadOrga];
                        break;
                    case '~':
                        addressMatrix[NeoPix_Pos].status = cBoard_Tilda[OFF_CHAR_DIM_5X7 - CharReadOrga];
                        break;

					case '\n':
						Offset.column = 1;
						Offset.line -= 8;	// Decrease Line of Height + 1 line to make a space.
						break;
					
					default :	/* State of every undefined case, so not supposed to come here. */	break;
				}
				
				// Coloring only One char at a Time :
				if(addressMatrix[NeoPix_Pos].status != 0)
				{
                    addressMatrix[NeoPix_Pos].colorPix = newColor;
				}
				else
				{
					addressMatrix[NeoPix_Pos].colorPix.Red = BRIGHT_MIN;
					addressMatrix[NeoPix_Pos].colorPix.Green = BRIGHT_MIN;
					addressMatrix[NeoPix_Pos].colorPix.Blue = BRIGHT_MIN;
				}
			}
		}
         // Space auto management while entering multiple char.
		if(*cP_CharToPrint != '\n')
		{
			// Position Increment on X :
			Offset.column += (Cnt_Col + 1);
		}
		else
		{ /* Nothin', avoid increase Col. after a \n. */ }
	}
}
#endif
/*
void char_SetColumnAndLine(const char* charToPrint, unsigned char* column, unsigned char* line)
{
    *column = 4; *line = 7;
    switch(*charToPrint)
    {	// Height & Width of letters can be different so a first Switch..Case is necessary.
        // Letters : --------------------------------------------------->
        case 'A':	case 'B':	case 'C':	case 'D':	case 'E':   case 'F':
        case 'G':	case 'H':	case 'I':	case 'J':   case 'K':   case 'L':
        case 'N':	case 'O':	case 'P':   case 'Q':	case 'R':	case 'S':
        case 'T':	case 'U':   case 'X':	case 'Y':	case 'Z':
            *column = 4;
            *line = 7;
            break;
        case 'M':	case 'V':	case 'W':
            *column = 5;
            *line = 7;
            break;
            // Numbers + Style : ------------------------------------------->
        case '0':	case '1':	case '2':	case '3':	case '4':
        case '5':	case '6':	case '7':	case '8':	case '9':
            switch(formatDisplay.txtFont)
            {
                case numberClassic:
                    *column = 4;
                    *line = 7;
                    break;
                case numberTime:
                    *column = 5;
                    *line = 7;
                    break;
                case numberMob:
                    *column = 4;
                    *line = 6;
                    break;
                default :	/* State of every undefined case, so not supposed to come here. *\\/	break;
            }
            break;
            // Special Char. : --------------------------------------------->
        case ' ':	case '.':   case ',':   case '!':
        case ':':	case '=':   case '*':   case '-':
        case '+':	case '%':   /*case '°':*\\/   case '/':
            *column = 3;
            *line = 7;
            break;

        case '\'':
            *column = 2;
            *line = 7;
            break;

        case '(':	case ')':   case '{':   case '}':
        case '[':	case ']':   case '~':   case '@':
        case '#':	case '&':
            *column = 5;
            *line = 7;
            break;

        case '_':
            *column = 4;
            *line = 7;
            break;

        case '^':
            *column = 7;
            *line = 6;
            break;

        case '?':
            switch(formatDisplay.txtFont)
            {
                case numberClassic:
                    *column = 4;
                    *line = 7;
                    break;
                case numberMob:
                    *column = 5;
                    *line = 7;
                    break;
                default :	/* State of every undefined case, so not supposed to come here. *\\/	break;
            }
            break;

        default :	/* State of every undefined case, so not supposed to come here. *\\/	break;
    }
}*/